app/views/users/index.html.erb

            <th>follows</th>
            <th><%= link_to @user.following_user.count, user_followings_path(@user) %></th>
---
SELECT "users".* FROM "users"

             <th><%= user.name %></th>
             <th><p>フォロー数:<%= user.following_user.count %></p></th>
             <th><p>フォロワー数:<%= user.followed_user.count %></p></th>
---
SELECT "users".* FROM "users"