app/views/users/show.html.erb

             <th><%= book.body %></th>
             <th><p>コメント件数：<%= book.comments.count %></p></th>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]