app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @book = Book.new
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."created_at" ASC  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = @user.books.order(:created_at)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND (created_at LIKE '2021-08-05%')  [["user_id", 1]]
---
  def search
    @user = User.find(params[:user_id])
    @book = Book.new
    @books = @user.books.order(:created_at)

    if params[:created_at] == ""
      @search_book = "日付を選択してください"
    else
      create_at = params[:created_at]
      @search_book = @books.where(['created_at LIKE ?',"#{create_at}%"]).count